import 'package:fci_app/app_bar.dart';
import 'package:fci_app/taps/tabs_design.dart';
import 'package:flutter/material.dart';
import 'package:pdf_flutter/pdf_flutter.dart';
import '../design.dart';

class AboutFacultyTab extends StatefulWidget {
  @override
  _AboutFacultyTabState createState() => _AboutFacultyTabState();
}

class _AboutFacultyTabState extends State<AboutFacultyTab>
    with SingleTickerProviderStateMixin {
  TabController _tabController;

  /*PDFDocument _doc_Policy;
  PDFDocument _doc_Strategy;
  bool _loading;*/

  @override
  void initState() {
    super.initState();
    _tabController = TabController(initialIndex: 5, length: 6, vsync: this);
  }

  @override
  void dispose() {
    _tabController.dispose();
    //loadFile();
    super.dispose();
  }

  String dropdownValue = 'عن الكلية';

  @override
  Widget build(BuildContext context) {
    return DropdownButtonHideUnderline(
      child: Center(
        child: DropdownButton<String>(
          hint: TabDesign(dropdownValue, Colors.grey.shade200),
          elevation: 1,
          iconSize: 0,
          style: TextStyle(color: Color.fromRGBO(162, 162, 162, 1)),
          onChanged: (String newValue) {
            // ignore: unnecessary_statements
            setState(() {
              if (newValue == 'نشأة الكلية') {
                Navigator.push(
                  context,
                  MaterialPageRoute(
                      builder: (context) => MainAppBar(
                          _tabController,
                          silverList(
                            'نشأة الكلية',
                            Column(
                              children: [
                                image('assets/images/about_faculty.jpg', context),
                                row("صــدر القرار الجمهورى رقم 267 لسنة 2006م والذى يتضمن إنشاء كلية الحاسبات والمعلومات بجامعة الفيوم. وافـق المجلس الأعلى للجامعات بجلسته بتاريخ 9/3/2006م على بدء الدراسة بالكلية اعتباراً من العام الجامعي 2006 – 2007 م."),
                                SizedBox(
                                  height: 8,
                                )
                              ],
                            ),
                          ),
                          context)),
                );
              } else if (newValue == 'شعار الكلية') {
                Navigator.push(
                  context,
                  MaterialPageRoute(
                      builder: (context) => MainAppBar(
                          _tabController,
                          silverList(
                            'شعار الكلية',
                            Column(
                              children: [
                                image('assets/images/cologo.jpg', context),
                                row('يتكون شعار كلية الحاسبات والمعلومات من جزئين الجزء الاول يمثل سواقي الفيوم والجزء الثاني يمثل تكنولوجيا المعلومات ويتكون من رقمين (0، 1) وهما يمثلان النقله في تكنولوجيا المعلومات من نظام الانلوج (analog)الي الديجيتال.(digital) .'),
                                SizedBox(
                                  height: 8,
                                ),
                              ],
                            ),
                          ),
                          context)),
                );
              } else if (newValue == 'التعريف بالكلية') {
                Navigator.push(
                  context,
                  MaterialPageRoute(
                      builder: (context) => MainAppBar(
                          _tabController,
                          silverList(
                              'التعريف الكلية',
                              Column(
                                children: [
                                  row('تعارفت جميع الجامعات والجمعيات العلمية العالمية على أن محور اهتمام علوم المعلومات Information Sciences هو الدراسة العلمية لكيفية استنباط وتوليد وتشفير وتحويل وإرسال وتجميع وتنظيم وتخزين واسترجاع وبث وقياس وتقييم المعلومات بما يلقى الضوء على تعددية التخصصات، هذا بالإضافة الى وجود العديد من التخصصات البينية.'),
                                  row('إن الدراسة بأقسام علوم الحاسب ونظم المعلومات تشكل مسارات أكاديمية تنخرط جميعها ضمن المسار العريض لعلوم المعلومات.'),
                                  row('ينصب الاهتمام الرئيسى لقسم علوم الحاسب على متابعة واستيعاب وتطوير المفاهيم العلمية وراء ما تنجزه الحاسبات وكيف تنجزه مع معرفة بناء الحاسبات وكيف تعمل، فيهتم القسم بتحليل وتصميم وقياس درجة تعقيد الخوارزميات المستخدمة فى حل المشكلات الحقيقة، ويركز القسم على تطبيقات الذكاء الاصطناعى التى تحاكى فيها الحاسبات السلوك الذكى للإنسان فى معالجة للمعلومات، ويدخل فى إطار اهتمام قسم علوم الحاسب تدريس وإجراء البحوث المتعلقة بمقرارات مثل: تحليل وتصميم الخوارزميات، اللغات الصورية ونظرية الاليات، تقييم أداء النظم، تعريب الحاسب، الذكاء الاصطناعى، النظم الخبيرة، الشبكات العصبية، الحسابات الموزعة، أساسيات البرمجة، البرمجة الهيكلية، البرمجة الشيئية، نظم التشغيل، نظرية مترجمات البرامج، معالجة الصور، البرمجة المنطقية معالجة الكلام، الرؤية بالحاسب، علوم الإدراك.'),
                                  row('ينصب الاهتمام الرئيسى لقسم نظم المعلومات على دراسة جميع القضايا الفنية وقضايا الإدارة العليا والسياسات التخطيطية المقترنة بتوظيف الحاسبات فى إنشاء نظم المعلومات للهيئات والمؤسسات.'),
                                  row('فيتطرق القسم بشكل متوازن للنواحى النظرية والعملية المتعلقة بتوصيف وتحليل وتصميم وتنفيذ وإدارة نظم المعلومات مع تعظيم الاستفادة من البنية الأساسية لتكنولوجيا المعلومات، ويدخل فى إطار اهتمام قسم نظم المعلومات تدريس وإجراء البحوث المتعلقة بمقرارات مثل : تحليل وتصميم النظم، هندسة المعلومات، أمان المعلومات، تطبيقات نظم المعلومات، نظم ميكنة العمل المكتبى، ميكنة المكتبات، نظم المعلومات الإدارية، نظم المعلومات الجغرافية، هندسة البرمجيات، هياكل البيانات، تنظيم الملفات، نظم إدارة قواعد البيانات، إدارة الأعمال، نظم دعم اتخاذ القرار، نظم معلومات التسويق، نظم التجارة الإلكترونية ، معالجة الصفقات، نظم معلومات إدارة الأزمات والتعافى من الكوارث، شبكات المعلومات، الوسائط المتعددة، التنقيب عن البيانات.'),
                                  SizedBox(
                                    height: 8,
                                  ),
                                ],
                              )),
                          context)),
                );
              } else if (newValue == 'منظومة القيم') {
                Navigator.push(
                  context,
                  MaterialPageRoute(
                      builder: (context) => MainAppBar(
                          _tabController,
                          silverList(
                              'منظومة القيم',
                              Column(
                                children: [
                                  row('هي مجموعة القيم التي تستمد منها الجامعة التوجيه في كل أنشطتها واختياراتها وأحكامها العامة والتعليمية والبحثية والثقافية والاجتماعية والسياسية والاقتصادية، بهدف رفع مستوى جودة حياة الأفراد، كهدف استراتيجي، والسعي إلى التطوير وتحقيق الإبداع في كل مناحي الحياة الجامعية. وفي هذا السياق، تتبنى الخطة الاستراتيجية لجامعة الفيوم (2016-2021) منظومة القيم والأخلاقيات الحاكمة التالية:'),
                                  image('assets/images/val.png', context),
                                  SizedBox(
                                    height: 8,
                                  )
                                ],
                              )),
                          context)),
                );
              } else if (newValue == 'الرسالة') {
                Navigator.push(
                  context,
                  MaterialPageRoute(
                      builder: (context) => MainAppBar(
                          _tabController,
                          silverList(
                              'الرسالة',
                              Column(
                                children: [
                                  row2(
                                    'رؤية الكلية :',
                                    'تتطلع كلية الحاسبات والمعلومات جامعة الفيوم للارتقاء والتميزفي مجال التعليم والبحث العلمى لتحقيق مكانة مرموقة محليا ودوليا وتنمية المجتمع معلوماتيا مع الالتزام بأخلاقيات المهنة.',
                                  ),
                                  row2('رسالة الكلية :',
                                      'تسعى كلية الحاسبات والمعلومات جامعة الفيوم إلى إعداد كوادر متخصصة ومتميزة في في مجال الحاسبات وتكنولوجيا المعلومات مؤهله ومزوده بالأسس النظرية والتطبيقية في مجال التخصص وقادرة على التعلم المستمرللمنافسة في سوق العمل فى إطار من القيم الأخلاقية، والإسهام فى تطوير البحث العلمى والتعاون المحليوالدولى لخدمة المجتمع.'),
                                  row2('أهداف الكلية:',
                                      '- إعداد خريجين في الحاسبات والمعلومات مؤهلين بالأسس النظرية ومنهجيات التطبيق بما يؤهلهم للمنافسة المحلية والاقليمية والعالمية في تطوير تكنولوجيا الحاسبات والمعلومات وتطبيقاتها.\n- إجراء الدراسات والبحوث العلمية والتطبيقية في مجال الحاسبات والمعلومات وفي مقدمتها تلك التي لها أثر مباشر علي التنمية المتكاملة والمستدامة في المجتمع.\n- توفير وتدعيم وسائل النشر والبحث العلمي في شتي مجالات التخصص.\n- عقد الاتفاقيات العلمية مع الهيئات والمؤسسات المناظرة علي المستوي المحلي والإقليمي والعالمي بهدف تبادل الآراء وإجراء البحوث المتعلقة بتخصصات الحاسبات والمعلومات.\n- تدريب الكوادر الفنية في قطاعات الدولة المختلفة علي تكنولوجيا الحاسبات والمعلومات.\n- تنظيم المؤتمرات وعقد الاجتماعات العلمية بهدف الارتقاء بالمستوي التعليمي وتعميق المفهوم العلمي بين الكوادر المتخصصة.\n- تقديم الاستشارات والمساعدات العلمية والفنية للهيئات والجهات التي تستخدم تكنولوجيا الحاسبات والمعلومات.\n- إنشاء وحدات خدمية متخصصة في الفروع المختلفة للحاسبات والمعلومات.\n- نشر الوعي الحاسوبي وتعميقه في المجتمع بهدف استخدام تكنولوجيا الحاسبات والمعلومات في قطاعات ومؤسسات الدولة المختلفة ، ورفع كفاءة استخدامها.'),
                                  SizedBox(
                                    height: 8,
                                  )
                                ],
                              )),
                          context)),
                );
              } else if (newValue == 'اللائحة الداخلية') {
                Navigator.push(
                  context,
                  MaterialPageRoute(
                      builder: (context) => MainAppBar(
                          _tabController,
                          silverList(
                              'اللائحة الداخلية',
                              Column(
                                children: [
                                  title2('مادة ( 1 )', Colors.red.shade900),
                                  title2('أهداف الكلية:', Colors.blue.shade800),
                                  Description(
                                      '1- إعداد المتخصصين في الحاسبات والمعلومات المؤهلين بالأسس النظرية ومنهجيات التطبيق بما يؤهلهم للمنافسة العالمية في تطوير تكنولوجيا الحاسبات والمعلومات وتطبيقاتها.\n2- إجراء الدراسات والبحوث العلمية والتطبيقية في مجال الحاسبات والمعلومات وفي مقدمتها التي لها أثر مباشر علي التنمية المتكاملة في المجتمع وإنشاء وحدات متخصصة في الفروع المختلفة للحاسبات والمعلومات.\n3- تقديم الإستشارات والمساعدات العملية والفنية للهيئات والجهات التي تستخدم تكنولوجيا الحاسبات والمعلومات وتهتم بصناعة واتخاذ القرار ودعمه.\n4- تدريب الكوادر الفنية في قطاعات الدولة المختلفة علي تكنولوجيا الحاسبات والمعلومات.\n5- نشر الوعي وتعميقه في المجتمع بهدف إستخدام تكنولوجيا الحاسبات والمعلومات في قطاعات ومؤسسات الدولة المختلفة ، ورفع كفاءة إستخدامها.\n6- تنظيم المؤتمرات وعقد الإجتماعات العلمية بهدف الإرتقاء بالمستوي التعليمي وتعميق المفهوم العلمي بين الكوادر المتخصصة.\n7- عقد الإتفاقيات العلمية مع الهيئات والمؤسسات المناظرة علي المستوي المحلي والإقليمي والعالمي بهدف تبادل الآراء وإجراء البحوث المتعلقة بتخصصات الحاسبات والمعلومات.\n8- توفير وتدعيم وسائل النشر والبحث العلمي في شتي مجالات التخصص .9. معرفة أساسيات العلاج المختلفة مع التركيز على الأهمية النسبية أو المزايا والعيوب لكل وسيلة علاج سواء كانت جراحية ، أم دوائية أم باستخدام التغذية الإكلينيكية ، أم الأشعة العلاجية أم العلاج الطبيعي وغيرها.'),
                                  title2('نظام الدراسة:', Colors.blue.shade800),
                                  Description(
                                      'ينقل الطالب من الفرقة المقيد بها إلي الفرقة التي تليها إذا نجح في جميع المقررات التي درسها أو كان راسباً فيما لا يزيد عن مقررين. المواظبة والانقطاع عن الدراسة:\n- تعقد امتحانات النقل وامتحان البكالوريوس في نهاية كل فصل دراسي في المقررات التي درسها الطالب في فرقته وفي المقررات المتخلفة عليه إن وجدت ويصدر مجلس الكلية بناء علي طلب مجالس الأقسام المختصة قرار بحرمان الطالب من التقدم للامتحان في المقررات التي لم يستوف بها نسبة الحضور 75% وفي هذه الحالة يعتبر الطالب راسباً في المقررات التي حرم من التقدم للامتحان فيها إلا إذا قدم عذراً يقبله مجلس الكلية فيعتبر الطالب غائباً بعذر مقبول.\n- تعقد امتحانات تكميلية في شهر سبتمبر لطلبة السنة الرابعة الراسبين فيما لا يزيد عن مقررين ولا يعقد امتحان تكميلي في مادة مشروع البكالوريوس.\n- يؤدى الطلاب تدريباً عملياً داخل الكلية للسنة الأولى والثانية لمدة أربعة أسابيع على الأقل خلال العطلة الصيفية ويحدد مجلس الكلية مجالات التدريب والمشرفين عليها ويمكن إجراء تدريبات خارج الكلية تحت الإشراف الأكاديمى لأعضاء هيئة التدريس.'),
                                  title2('مادة ( 2 )', Colors.red.shade900),
                                  title2(
                                      'أقسام الكلية :', Colors.blue.shade800),
                                  Description(
                                      'تتكون الكلية من الأقسام العلمية الآتية:\n1. قسم العلوم الأساسية .\n2. قسم علوم الحاسب .\n3. قسم نظم المعلومات .\nولمجلس الكلية الحق في إتخاذ إجراءات إنشاء أقسام جديدة عند الحاجة إليها وعند توافر الإمكانيات البشريةوالمادية .'),
                                  title2('مادة ( 3 )', Colors.red.shade900),
                                  title2('الدرجات العلمية :',
                                      Colors.blue.shade800),
                                  Description(
                                      'تمنح جامعة الفيوم بناء علي طلب مجلس كلية الحاسبات والمعلومات درجة البكالوريوس في :\nعلوم الحاسب .\nنظم المعلومات .'),
                                  title2('مادة ( 4 )', Colors.red.shade900),
                                  title2(
                                      'مراحل الدراسة :', Colors.blue.shade800),
                                  Description(
                                      'مدة الدراسة في الكلية أربعة أعوام دراسية مقسمة إلي ثمان فصول .'),
                                  title2('مادة ( 5 )', Colors.red.shade900),
                                  title2(
                                      'نظام الدراسة :', Colors.blue.shade800),
                                  Description(
                                      'ينقل الطالب من الفرقة المقيد بها إلي الفرقة التي تليها إذا نجح في جميع المقررات التي درسها أو كان راسبا فيها بما لا يزيد عن مقررين .'),
                                  title2('مادة ( 6 )', Colors.red.shade900),
                                  title2('المواظبة والانقطاع عن الدراسة:',
                                      Colors.blue.shade800),
                                  Description(
                                      'تعقد امتحانات النقل وامتحان البكالوريوس في نهاية كل فصل دراسي في المقررات التي درسها الطالب في فرقته وفي المقررات المتخلفة عليه إن وجدت ويصدر مجلس الكلية بناء علي طلب مجالس الأقسام المختصة قرار بحرمان الطالب من التقدم للامتحان في المقررات التي لم يستوف بها نسبة الحضور 75% وفي هذه الحالة يعتبر الطالب راسباً في المقررات التي حرم من التقدم للامتحان فيها إلا إذا قدم عذراً يقبله مجلس الكلية فيعتبر الطالب غائباً بعذر مقبول.'),
                                  title2('مادة ( 7 )', Colors.red.shade900),
                                  Description(
                                      'مدة الدراسة في الكلية أربعة أعوام دراسية مقسمة إلي ثمان فصول .تعقد امتحانات تكميلية في شهر سبتمبر لطلبة السنة الرابعة الراسبين فيما لا يزيد عن مقررين ولا يعقد امتحان تكميلي في مادة مشروع البكالوريوس.'),
                                  title2('مادة ( 8 )', Colors.red.shade900),
                                  Description(
                                      '- يؤدى الطلاب تدريباً عملياً داخل الكلية للسنة الأولى والثانية لمدة أربعة أسابيع على الأقل خلال العطلة الصيفية ويحدد مجلس الكلية مجالات التدريب والمشرفين عليها ويمكن إجراء تدريبات خارج الكلية تحت الإشراف الأكاديمى لأعضاء هيئة التدريس'),
                                  title2('مادة ( 9 )', Colors.red.shade900),
                                  Description(
                                      'يحسب تقدير النجاح في كل مقرر وكذلك عند النقل إلي الفرقة الأعلي والمجموع التراكمي طبقاً للآتي:'),
                                  SizedBox(
                                    height: 8,
                                  ),
                                  Padding(
                                    padding: const EdgeInsets.all(8.0),
                                    child: Table(
                                      border: TableBorder.all(
                                          width: 1, color: Colors.white),
                                      defaultColumnWidth: FlexColumnWidth(1),
                                      columnWidths: {
                                        1: FractionColumnWidth(.45),
                                        0: FractionColumnWidth(0.2)
                                      },
                                      defaultVerticalAlignment:
                                          TableCellVerticalAlignment.middle,
                                      children: [
                                        TableRow(
                                          decoration: BoxDecoration(
                                            color: Colors.grey.shade200,
                                          ),
                                          children: [
                                            column('ممتاز'),
                                            column('85% فأكثر'),
                                            column('من مجموع الدرجات'),
                                          ],
                                        ),
                                        TableRow(
                                          decoration: BoxDecoration(
                                            color: Colors.grey.shade200,
                                          ),
                                          children: [
                                            column('جيد جدا'),
                                            column('من 75% إلى أقل من 85%'),
                                            column('من مجموع الدرجات'),
                                          ],
                                        ),
                                        TableRow(
                                          decoration: BoxDecoration(
                                            color: Colors.grey.shade200,
                                          ),
                                          children: [
                                            column('جيد'),
                                            column('من 65% إلى أقل من 75%'),
                                            column('من مجموع الدرجات'),
                                          ],
                                        ),
                                        TableRow(
                                          decoration: BoxDecoration(
                                            color: Colors.grey.shade200,
                                          ),
                                          children: [
                                            column('مقبول'),
                                            column('من 60% إلى أقل من 65%'),
                                            column('من مجموع الدرجات'),
                                          ],
                                        ),
                                      ],
                                    ),
                                  ),
                                  Description(
                                      ' ويرسب الطالب إذا حصل علي تقدير .'),
                                  Padding(
                                    padding: const EdgeInsets.all(8.0),
                                    child: Table(
                                      border: TableBorder.all(
                                          width: 1, color: Colors.white),
                                      defaultVerticalAlignment:
                                          TableCellVerticalAlignment.middle,
                                      children: [
                                        TableRow(
                                          decoration: BoxDecoration(
                                            color: Colors.grey.shade200,
                                          ),
                                          children: [
                                            column(
                                                'ضعيف من 30% إلى اقل من 50%'),
                                            column('من مجموع الدرجات'),
                                          ],
                                        ),
                                        TableRow(
                                          decoration: BoxDecoration(
                                            color: Colors.grey.shade200,
                                          ),
                                          children: [
                                            column('ضعيف جداّ  إلى اقل من 30%'),
                                            column('من مجموع الدرجات'),
                                          ],
                                        ),
                                      ],
                                    ),
                                  ),
                                  title2('مادة ( 10 ) :', Colors.red.shade900),
                                  title2('المجموع التراكمى :',
                                      Colors.blue.shade800),
                                  Description(
                                      'تحسب درجات تخرج الطالب وفقاً للمجموع التراكمى خلال سنوات الدراسة الأربع ، ويصبح تقدير الطالب فى مجموع السنوات الأربع هو تقدير تخرجه النهائى.'),
                                  title2('مادة ( 11 ) :', Colors.red.shade900),
                                  title2('البحوث والمشروعات :',
                                      Colors.blue.shade800),
                                  Description(
                                      'يقوم طلبة السنة الرابعة بإعداد مشروع البكالوريوس في موضوعات معينة تحددها مجالس الأقسام العلمية المختصة ويتفرغ الطلبة لذلك فترة يحددها مجلس الكلية بعد نهاية إمتحان الفصل الدراسي الثاني.'),
                                  title2('مادة ( 12 ) :', Colors.red.shade900),
                                  centerTitle('**  المقررات الدراسية  **'),
                                  title2('1- قسم العلوم الأساسية :',
                                      Colors.blue.shade800),
                                  Description(
                                      'رياضيات – فيزياء – إلكترونيات – لغة إنجليزية – لغويات حسابية – إنسانيات – إدارة أعمال – كتابة التقارير – أصول المهنة وشرعيتها – الاحتمالات والإحصاء – تحليل إحصائي وتطبيقي – بحوث العمليات – اقتصاديات تطوير البرامج.'),
                                  title2('2- قسم علوم الحاسب :',
                                      Colors.blue.shade800),
                                  Description(
                                      'مقدمة حاسبات – أساسيات البرمجة الهيكلية – التصميم المنطقي – البرمجة الشيئية – اللغات الصورية ونظرية الآليات – أساليب الحسابات العددية البرمجة المنطقية – تحليل ونظم الخوارزميات – هندسة البرمجيات – لغة التجميع – النمذجة والمحاكاة – نظرية مترجمات لغة البرامج – معالجة الصور – شبكات الحاسبات – نظرية الحاسبات – الشبكات العصبية – الحسابات الموزعة أساليب أمان الحاسبات – المقرر الإختياري – مشروع علوم الحاسب.'),
                                  title2('3- قسم نظم المعلومات :',
                                      Colors.blue.shade800),
                                  Description(
                                      'هياكل البيانات – تنظيم الملفات – أساليب الحسابات العددية – تحليل وتصميم النظم – نظم إدارة قواعد البيانات – إقتصاديات تطوير البرامج – نظم المعلومات الإدارية – هندسة المعلومات – التجارة الإلكترونية – إدارة الأزمات والكوارث – نظم المعلومات الجغرافية – نظم ميكنة العمل المكتبي – نظم دعم إتخاذ القرار – المقرر الإختيار – مشروع نظم المعلومات.'),
                                  title2('مادة ( 13 ) :', Colors.red.shade900),
                                  Description(
                                      'تطبق أحكام قانون تنظيم الجامعات ولائحته التنفيذية فيما لم يرد فيه نص فى هذه اللائحة.'),
                                  title2(
                                      ' اتحاد الطلاب :', Colors.blue.shade800),
                                  Description(
                                      'وهناك بعض الشروط التى يجب توافرها فى الطلاب المرشحين لعضوية مجلس الاتحاد أهمها:\n1- أن يكون مصرى الجنسية.\n2- أن يتصف بالخلق القويم.\n3- أن يكون طالباً مستجداً فى فرقته وغير باق للإعادة ومسدد رسوم الاتحاد.\n4- أن يكون ذا نشاط ملحوظ فى مجال عمل اللجنة التى يرشح نفسه بها.\n5- ألا يكون قد سبق الحكم عليه بعقوبة.\nهذا وتتم الانتخابات فى نهاية شهر نوفمبر من كل عام ولا يحق لأى طالب أن يدلى بصوته إلا إذا كان مقيداً بالجداول الخاصة بالطلاب الناخبين ويحمل إثبات شخصية وما يفيد سداد رسوم الاتحاد ويشترط لاتمام الانتخابات حضور 50% على الأقل من الطلاب الذين لهم حق الانتخاب، وفى حالة عدم اكتمال العدد تعاد الانتخابات بعد ثلاثة أيام على الأكثر، ويشترط حضور 20% على الأقل، ويستبعد تمثيل كل طلبة الفرقة التى لم يكتمل عدد ناخبيها بعد ذلك، وفى حالة تعذر تكوين مجلس اتحاد الكلية بسبب عدم اكتمال النصاب القانونى يعين عميد الكلية مجلساً لإدارة شئون الاتحاد من الطلاب المتفوقين.'),
                                  title2('ملحـوظة :', Colors.blue.shade800),
                                  Description(
                                      'كل من يخالف القواعد المنظمة للاتحادات والتقاليد الجامعية المرعية توقع عليه إحدى العقوبات الآتية بعد سماع أقواله وهى:-\n1- وقف العضو عن ممارسة أنشطة الاتحاد لمدة أقصاها شهرين.\n2- إسقاط العضوية عن العضو من الاتحاد لمدة سنة.\n3- إسقاط العضوية عن العضو من مجلس الاتحاد أو لجانه.\nويتم توقيع العقوبة الأولى بقرار من عميد الكلية، أما بالنسبة للعقوبات الثانية والثالثة فتصدر بها قرار من رئيس الجامعة. ويكون لاتحاد الطلاب لائحة مالية وإدارية تصدر بقرار من رئيس المجلس الأعلى للجامعات.'),
                                  title2('صندوق التكافل الإجتماعي :',
                                      Colors.blue.shade800),
                                  Description(
                                      'يهدف الصندوق إلى المساهمة فى الخدمات وتوفير الرعاية الاجتماعية للطلاب بما يقدمه من مساعدات مالية وعينية لغير القادرين منهم وأهم هذه المساعدات هى:\n(1) سداد الرسوم الدراسية.\n(2) إعانة النظارات الطبية والأجهزة التعويضية.\n(3) إعانة نقدية.\nهذا ويبدأ جهاز رعاية الشباب بالكلية فى صرف استمارات البحث الاجتماعى والخاص بالمساعدات المختلفة اعتباراً من أول العام الدراسى.'),
                                  title2(
                                      'تجنيد الطلاب :', Colors.blue.shade800),
                                  Description(
                                      'القواعد الواردة بقانون التجنيد رقم (127) لسنة 1980 فيما يختص بقطاع الطلاب:\nحيث ان قسم شئون الطلاب بالكلية تقوم بعمل التأجيل للطلاب حتي سن 28 عاما .'),
                                  centerTitle('** النظام الكودي **'),
                                  Padding(
                                    padding: const EdgeInsets.all(8.0),
                                    child: Table(
                                      border: TableBorder.all(
                                          width: 1, color: Colors.white),
                                      children: [
                                        TableRow(
                                          decoration: BoxDecoration(
                                            color: Colors.grey.shade200,
                                          ),
                                          children: [
                                            column('قسم العلوم الأساسية'),
                                            column('عام'),
                                          ],
                                        ),
                                        TableRow(
                                          decoration: BoxDecoration(
                                            color: Colors.grey.shade200,
                                          ),
                                          children: [
                                            column('قسم علوم الحاسب الآلي'),
                                            column('حسب'),
                                          ],
                                        ),
                                        TableRow(
                                          decoration: BoxDecoration(
                                            color: Colors.grey.shade200,
                                          ),
                                          children: [
                                            column('قسم نظم المعلومات'),
                                            column('نظم'),
                                          ],
                                        ),
                                      ],
                                    ),
                                  ),
                                  centerTitle('** تكويد المقرر **'),
                                  Padding(
                                    padding: const EdgeInsets.all(8.0),
                                    child: Table(
                                      border: TableBorder.all(
                                          width: 1, color: Colors.white),
                                      children: [
                                        TableRow(
                                          decoration: BoxDecoration(
                                            color: Colors.grey.shade200,
                                          ),
                                          children: [
                                            column('الفرقة (1 - 4)'),
                                          ],
                                        ),
                                        TableRow(
                                          decoration: BoxDecoration(
                                            color: Colors.grey.shade200,
                                          ),
                                          children: [
                                            column('رقم المجموعة (0- 9)'),
                                          ],
                                        ),
                                        TableRow(
                                          decoration: BoxDecoration(
                                            color: Colors.grey.shade200,
                                          ),
                                          children: [
                                            column(
                                                'مسلسل المقرر تبعاً لمجموعته علي مستوي الفرقة (0 - 9)'),
                                          ],
                                        ),
                                        TableRow(
                                          decoration: BoxDecoration(
                                            color: Colors.grey.shade200,
                                          ),
                                          children: [
                                            column(
                                                'كود القسم (عام – حسب - نظم)'),
                                          ],
                                        ),
                                      ],
                                    ),
                                  ),
                                  centerTitle('** مجموعات المقررات **'),
                                  Padding(
                                    padding: const EdgeInsets.all(8.0),
                                    child: Table(
                                      border: TableBorder.all(
                                          width: 1, color: Colors.white),
                                      children: [
                                        TableRow(
                                          decoration: BoxDecoration(
                                            color: Colors.grey.shade200,
                                          ),
                                          children: [
                                            column('رقم المجموعة'),
                                            column('إسم المجموعة'),
                                          ],
                                        ),
                                        TableRow(
                                          decoration: BoxDecoration(
                                            color: Colors.grey.shade200,
                                          ),
                                          children: [
                                            column('0'),
                                            column('المشروع'),
                                          ],
                                        ),
                                        TableRow(
                                          decoration: BoxDecoration(
                                            color: Colors.grey.shade200,
                                          ),
                                          children: [
                                            column('1'),
                                            column('العلوم الإنسانية'),
                                          ],
                                        ),
                                        TableRow(
                                          decoration: BoxDecoration(
                                            color: Colors.grey.shade200,
                                          ),
                                          children: [
                                            column('2'),
                                            column('العلوم الاساسية'),
                                          ],
                                        ),
                                        TableRow(
                                          decoration: BoxDecoration(
                                            color: Colors.grey.shade200,
                                          ),
                                          children: [
                                            column('3'),
                                            column('الحسابات العلمية'),
                                          ],
                                        ),
                                        TableRow(
                                          decoration: BoxDecoration(
                                            color: Colors.grey.shade200,
                                          ),
                                          children: [
                                            column('4'),
                                            column('علوم الحاسـب'),
                                          ],
                                        ),
                                        TableRow(
                                          decoration: BoxDecoration(
                                            color: Colors.grey.shade200,
                                          ),
                                          children: [
                                            column('5'),
                                            column('برمجيات الحاسب'),
                                          ],
                                        ),
                                        TableRow(
                                          decoration: BoxDecoration(
                                            color: Colors.grey.shade200,
                                          ),
                                          children: [
                                            column('6'),
                                            column('بنية الحاسب'),
                                          ],
                                        ),
                                        TableRow(
                                          decoration: BoxDecoration(
                                            color: Colors.grey.shade200,
                                          ),
                                          children: [
                                            column('7'),
                                            column('قواعد البيانات'),
                                          ],
                                        ),
                                        TableRow(
                                          decoration: BoxDecoration(
                                            color: Colors.grey.shade200,
                                          ),
                                          children: [
                                            column('8'),
                                            column('نظم المعلومـات'),
                                          ],
                                        ),
                                        TableRow(
                                          decoration: BoxDecoration(
                                            color: Colors.grey.shade200,
                                          ),
                                          children: [
                                            column('9'),
                                            column('مقررات إختيارية'),
                                          ],
                                        ),
                                      ],
                                    ),
                                  ),
                                  Description(
                                      'مثال: عام 111\nتفسير من الشمال الى اليمين مقرر للفرقة الاولى(1) - من مجموعة العلوم الانسانية(1) – مسلسل المقرر (1) – كود القسم (عام).'),
                                  SizedBox(
                                    height: 8,
                                  )
                                ],
                              )),
                          context)),
                );
              } else if (newValue == 'اللائحة الدراسية') {
                Navigator.push(
                  context,
                  MaterialPageRoute(
                      builder: (context) => MainAppBar(
                          _tabController,
                          silverList(
                              'اللائحة الدراسية',
                              Padding(
                                padding: const EdgeInsets.all(8.0),
                                child: Column(
                                  children: [
                                    Container(
                                      child: RaisedButton(
                                        child: Text('الفرقة الأولى'),
                                        onPressed: () {
                                          Navigator.push(
                                            context,
                                            MaterialPageRoute(
                                                builder: (context) => MainAppBar(
                                                    _tabController,
                                                    silverList(
                                                        'اللائحة الدراسية للفرقة الأولى',
                                                        Column(
                                                          children: [
                                                            centerTitle(
                                                                "الفصل الدراسي الأول"),
                                                            image('assets/images/ed11.jpg',
                                                                context),
                                                            centerTitle(
                                                                "الفصل الدراسي الثانى"),
                                                            image('assets/images/ed12.jpg',
                                                                context),
                                                            SizedBox(
                                                              height: 8,
                                                            )
                                                          ],
                                                        )),
                                                    context)),
                                          );
                                        },
                                      ),
                                      width: double.infinity,
                                    ),
                                    Container(
                                      child: RaisedButton(
                                        child: Text('الفرقة الثانية'),
                                        onPressed: () {
                                          Navigator.push(
                                            context,
                                            MaterialPageRoute(
                                                builder: (context) => MainAppBar(
                                                    _tabController,
                                                    silverList(
                                                        'اللائحة الدراسية للفرقة الثانية',
                                                        Column(
                                                          children: [
                                                            centerTitle(
                                                                "الفصل الدراسي الأول"),
                                                            image('assets/images/ed21.jpg',
                                                                context),
                                                            centerTitle(
                                                                "الفصل الدراسي الثانى"),
                                                            image('assets/images/ed22.jpg',
                                                                context),
                                                            SizedBox(
                                                              height: 8,
                                                            )
                                                          ],
                                                        )),
                                                    context)),
                                          );
                                        },
                                      ),
                                      width: double.infinity,
                                    ),
                                    Container(
                                      child: RaisedButton(
                                        child: Text('الفرقة الثالثة'),
                                        onPressed: () {
                                          Navigator.push(
                                            context,
                                            MaterialPageRoute(
                                                builder: (context) => MainAppBar(
                                                    _tabController,
                                                    silverList(
                                                        'اللائحة الدراسية للفرقة الثالثة',
                                                        Column(
                                                          children: [
                                                            centerTitle(
                                                                "الفصل الدراسي الأول"),
                                                            image('assets/images/ed31.jpg',
                                                                context),
                                                            centerTitle(
                                                                "الفصل الدراسي الثانى"),
                                                            image('assets/images/ed32.jpg',
                                                                context),
                                                            SizedBox(
                                                              height: 8,
                                                            )
                                                          ],
                                                        )),
                                                    context)),
                                          );
                                        },
                                      ),
                                      width: double.infinity,
                                    ),
                                    Container(
                                      child: RaisedButton(
                                        child: Text('الفرقة الرابعة'),
                                        onPressed: () {
                                          Navigator.push(
                                            context,
                                            MaterialPageRoute(
                                                builder: (context) => MainAppBar(
                                                    _tabController,
                                                    silverList(
                                                        'اللائحة الدراسية للفرقة الرابعة',
                                                        Column(
                                                          children: [
                                                            centerTitle(
                                                                "الفصل الدراسي الأول (علوم الحاسب)"),
                                                            image('assets/images/ed411.jpg',
                                                                context),
                                                            centerTitle(
                                                                "الفصل الدراسي الأول (نظم المعلومات)"),
                                                            image('assets/images/ed412.jpg',
                                                                context),
                                                            centerTitle(
                                                                "الفصل الدراسي الثانى (علوم الحاسب)"),
                                                            image('assets/images/ed413.jpg',
                                                                context),
                                                            centerTitle(
                                                                "الفصل الدراسي الثانى (نظم المعلومات)"),
                                                            image('assets/images/ed414.jpg',
                                                                context),
                                                            SizedBox(
                                                              height: 8,
                                                            )
                                                          ],
                                                        )),
                                                    context)),
                                          );
                                        },
                                      ),
                                      width: double.infinity,
                                    ),
                                  ],
                                ),
                              )),
                          context)),
                );
              } else if (newValue == 'سياسة الكلية') {
                Navigator.push(
                    context,
                    MaterialPageRoute(
                      builder: (context) => PDF.assets(
                        'assets/pdfs/policy.pdf',
                        width: double.infinity,
                        height: double.infinity,
                      ),
                    ));
              } else if (newValue == 'استراتيجية التعليم') {
                Navigator.push(
                    context,
                    MaterialPageRoute(
                        builder: (context) => Container(
                              color: Colors.white,
                              child: PDF.assets(
                                'assets/pdfs/Strategy.pdf',
                                width: double.infinity,
                                height: double.infinity,
                              ),
                            )));
              } else if (newValue == 'الدرجات العلمية') {
                Navigator.push(
                  context,
                  MaterialPageRoute(
                      builder: (context) => MainAppBar(
                          _tabController,
                          silverList(
                              'الدرجات العلميه ومدة الدراسة',
                              Column(
                                children: [
                                  title2(
                                      'الدرجات العلميه', Colors.red.shade900),
                                  Description(
                                      ' تمنح الجامعه بناء على طلب الكليه الدرجات العلميه الآتيه :\n* درجة البكالوريوس فى أحد التخصصات الآتيه:\nعلوم الحاسب – نظم المعلومات'),
                                  title2(' مدة الدراسه :', Colors.red.shade900),
                                  Description(
                                      'أربع سنوات لنيل درجة البكالوريوس\n- يمنح مجلس جامعة الفيوم بناءً على طلب مجلس كلية الحاسبات والمعلومات درجة دبلوم الدراسات العليا فى احدى التخصصات الآتية:\n- علوم الحاسب (مهنية) فى احدى التخصصات التالية:\n 1 –" شبكات الحاسب" 2- " برمجة الويب" .\n- علوم الحاسب فى( اكادمية) "معالجة البيانات الكبيرة"\n- نظم المعلومات ( مهنية): "ادارة قواعد البيانات"'),
                                  SizedBox(
                                    height: 8,
                                  )
                                ],
                              )),
                          context)),
                );
              } else if (newValue == 'وسائل التواصل') {
                Navigator.push(
                  context,
                  MaterialPageRoute(
                      builder: (context) => MainAppBar(
                          _tabController,
                          silverList(
                              'وسائل الإتصال الحديثة',
                              Column(
                                children: [
                                  title2('وسائل الاتصالات الحديثة بالكلية:',
                                      Colors.red.shade900),
                                  Description(
                                      'تتوافر بالكلية عدة وسائل إتصال تربط بين الأقسام المختلفة وإدارة الكلية. كما توجد بالكلية عدة وسائل اتصال تربط بين إدارة الكلية وإدارة الجامعة وكذلك كليات الجامعة المختلفة بالإضافة إلى وجود اتصال بجميع أنحاء جمهورية مصر العربية.\n\nتتمثل هذه الوسائل فى وجود تليفون مباشر وتليفون محمول وفاكس بمكتب الأستاذ الدكتور عميد الكلية وشبكة خطوط تليفونية داخلية تربط جميع أقسام الكلية ببعضها عن طريق 2 سويتش. كما يوجد الإتصال الدولى عن طريق شبكة الإنترنت بالكلية)سلكى، ولاسلكى( وهى تعتبر شبكة اتصالات دولية تربط الكلية بجميع أنحاء العام.'),
                                  title2(
                                      'الجدول التالى يوضح نوع ومكان وسائل الاتصالات المتاحة بالكلية:',
                                      Colors.red.shade900),
                                  Padding(
                                    padding: const EdgeInsets.all(4.0),
                                    child: Table(
                                      border: TableBorder.all(
                                          color: Colors.white, width: 1),
                                      columnWidths: {
                                        0: FractionColumnWidth(0.35),
                                        1: FractionColumnWidth(0.35),
                                        2: FractionColumnWidth(0.23),
                                        3: FractionColumnWidth(0.07)
                                      },
                                      defaultVerticalAlignment:
                                          TableCellVerticalAlignment.middle,
                                      children: [
                                        TableRow(
                                            decoration: BoxDecoration(
                                              color: Color.fromRGBO(
                                                  0, 128, 102, 1),
                                            ),
                                            children: [
                                              column_color('الهدف منها'),
                                              column_color('مكان التواجد'),
                                              column_color(
                                                  ' نوع وسيلة الاتصال'),
                                              column_color('م'),
                                            ]),
                                        TableRow(
                                            decoration: BoxDecoration(
                                              color: Colors.grey.shade200,
                                            ),
                                            children: [
                                              column(
                                                  ' الربط بين أقسام ووحدات الكلية المختلفة لتوفير الوقت والجهد وسرعة الأداء'),
                                              column(
                                                  'تتوافر بجميع أقسام الكلية وإدارات الكلية'),
                                              column(
                                                  'شبكة تليفونات داخلية بالكلية'),
                                              column('1'),
                                            ]),
                                        TableRow(
                                            decoration: BoxDecoration(
                                              color: Colors.grey.shade200,
                                            ),
                                            children: [
                                              column(
                                                  ' الربط بين إدارة الكلية وبين إدارات الجامعة ورئاسة الجامعة والمجتمع الخارجى'),
                                              column(
                                                  ' - مكتب عميد الكلية\n- مكتب وكيل الكلية لشئون التعليم والطلاب\n- مكتب أمين الكلية'),
                                              column('عدد ( 3 ) تليفون أرضى'),
                                              column('2'),
                                            ]),
                                        TableRow(
                                          decoration: BoxDecoration(
                                            color: Colors.grey.shade200,
                                          ),
                                          children: [
                                            column(
                                                ' لإمكانية الإتصال بجميع أنحاء جمهورية مصر العربية'),
                                            column(' مكتب عميد الكلية'),
                                            column(' عدد ( 1 ) تليفون مباشر'),
                                            column('3'),
                                          ],
                                        ),
                                        TableRow(
                                            decoration: BoxDecoration(
                                              color: Colors.grey.shade200,
                                            ),
                                            children: [
                                              column(
                                                  ' لإمكانية الإتصال بالتليفونات المحمولة بجميع أنحاء جمهورية مصر العربية بتكلفة منخفضة'),
                                              column('مكتب عميد الكلية'),
                                              column('عدد ( 1 ) تليفون محمول'),
                                              column('4'),
                                            ]),
                                        TableRow(
                                            decoration: BoxDecoration(
                                              color: Colors.grey.shade200,
                                            ),
                                            children: [
                                              column(
                                                  'لإمكانية إرسال المستندات إلى جميع أنحاء جمهورية مصر العربية واستقبالها من أى مكان بالعالم'),
                                              column('مكتب عميد الكلية'),
                                              column('عدد ( 1 ) فاكس'),
                                              column('5'),
                                            ]),
                                        TableRow(
                                            decoration: BoxDecoration(
                                              color: Colors.grey.shade200,
                                            ),
                                            children: [
                                              column(
                                                  ' - إرسال واستقبال البريد الالكترونى\n- الاطلاع على المواقع المختلفة\n-تحميل البرامج المتاحة على الشبكة\n-تحديث البرامج المثبتة على أجهزة الكلية'),
                                              column(
                                                  'تتوافر بجميع أقسام الكلية ووحداتها ومعاملها وتعتبر متاحة لجميع أفراد مجتمع الكلية (طلاب – عاملين – أعضاء هيئة التدريس)'),
                                              column('شبكة الإنترنت'),
                                              column('6'),
                                            ]),
                                      ],
                                    ),
                                  ),
                                  SizedBox(
                                    height: 8,
                                  )
                                ],
                              )),
                          context)),
                );
              }
            });
          },
          dropdownColor: Color.fromRGBO(244, 244, 244, 1),
          items: <String>[
            'نشأة الكلية',
            'شعار الكلية',
            'التعريف بالكلية',
            'منظومة القيم',
            'الرسالة',
            'اللائحة الداخلية',
            'اللائحة الدراسية',
            'سياسة الكلية',
            'وسائل التواصل',
            'الدرجات العلمية',
            'استراتيجية التعليم',
          ].map<DropdownMenuItem<String>>((String value) {
            return DropdownMenuItem<String>(
              value: value,
              child: TabDesign(value, Colors.grey.shade300),
            );
          }).toList(),
        ),
      ),
    );
  }
}
