import 'package:flutter/material.dart';
import '../app_bar.dart';
import '../design.dart';
import '../main_card.dart';

class CrisisAndDisasterUnit extends StatelessWidget {
  final TabController tabController;

  const CrisisAndDisasterUnit({Key key, this.tabController}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return MainAppBar(
        tabController,
        silverList(
          'وحدة الازمات والكوارث',
          Container(
            color: Color.fromRGBO(227, 225, 225, 1),
            child: Column(
              children: [
                MainCard(
                  'عن الوحدة',
                  Padding(
                    padding: const EdgeInsets.all(8.0),
                    child: Column(
                      children: [
                        centerTitle('نبذة عن الوحدة'),
                        row('لقد أصبحنا في عصر تتكرر حدوث أزمات أو كوارث وبالتالي لابد من الاستعداد لمثل هذه الأزمات والكوارث. ومن الضروري وضع آليات وخطط للاستعداد والتعامل مع هذه الأزمات والكوارث.'),
                        Description(
                            'وعلى هذا الأساس تم استحداث وحدة متخصصة لإدارة الأزمات والكوارث بكلية الحاسبات والمعلومات-جامعة الفيوم- بحيث تضم الوحدة هيكلا اداريا و فريق متميز لإدارة الأزمات والكوارث.\nوتهدف هذه الوحدة الى مواجهة الأزمات والحالات الطارئة والتهديدات وذلك من خلال إعداد خطط وسيناريوهات شاملة لسرعة الاستجابة والتعامل الأمثل مع الأزمات المتوقع حدوثها بالكلية قبل وأثناء حدوثها.\nوتوضح بالخطط مجموعات العمل والكوادر البشرية المدربة بحيث تدرك كل مجموعة دورها فى التعامل مع الأزمات وعمل تقييم للخطط لمنع تكرار حدوث تلك الأزمات مستقبلا'),
                        centerTitle('خطة الوحدة'),
                        row2(' تهدف خطة وحدة الازمات والكوارث الى :',
                            '• تحديد مواطن الضعف والتهديدات بالكلية.\n• التدريب المستمر على الخطط والسيناريوهات المختلفة لمواجهة الأزمات حال حدوثها\n• اعداد سجل للأزمات لتوثيق المواقفالتي تهدد الكلية وتعتبرها أزمات أو كوارث\n• عقد البرامج التدريبية وورش العمل للأفراد بالكلية في مجال إدارة الأزمات .\nاعداد مخططات توضيحية بمرافق ومباني ومنشآت الكلية\n• تحديد آليات للتعاون مع المنظمات والهيئات والإدارات المحيطة بالكلية فى مجال مواجهة الأزمات والكوارث\n• نقل وتبادل الخبرات والتجارب الناجحة في مجال مواجهة الأزمات و الكوارث\n• الاهتمام باستكمال وتطوير الأجهزة والمعدات التي تستخدم في مواجهة الأزمات و الكوارث بأنواعها المختلفة\n• تطوير مهارات اعضاء لجنة الأزمات والكوارث في مواجهة التحديات المختلفة.\n• الحفاظ على أمان واستقرار الكلية.'),
                        row_pdf('دليل الوحدة', 'guide', context),
                        SizedBox(
                          height: 16,
                        ),
                      ],
                    ),
                  ),
                ),
                MainCard(
                  'مجلس الإدارة',
                  Padding(
                    padding: const EdgeInsets.all(8.0),
                    child: Column(
                      children: [
                        row('وحدة الأزمات والكوارث بكلية الحاسبات والمعلومات-جامعة الفيوم هي إحدى الوحدات المستحدثة بالهيكل التنظيمي للكلية، وهي تابعة لوكيل الكلية لشئون خدمة المجتمع وتنمية البيئة وتشكيل مجلس إدارة وحدة ادارة الازمات والكوارث بالكلية على النحو التالي :'),
                        Table(
                          defaultVerticalAlignment:
                              TableCellVerticalAlignment.middle,
                          columnWidths: {
                            0: FractionColumnWidth(.45),
                            1: FractionColumnWidth(.40),
                            2: FractionColumnWidth(0.15)
                          },
                          border:
                              TableBorder.all(width: 1, color: Colors.white),
                          textDirection: TextDirection.rtl,
                          children: [
                            TableRow(
                                decoration: BoxDecoration(
                                  color: Colors.grey.shade200,
                                ),
                                children: [
                                  column(
                                      'أ.د.رانيا أحمد عبد العظيم أبو السعود'),
                                  column('عميد الكلية'),
                                  column('رئيس مجلس الإدارة'),
                                ]),
                            TableRow(
                                decoration: BoxDecoration(
                                  color: Colors.grey.shade200,
                                ),
                                children: [
                                  column('أ.م.د طروب عبد النبى'),
                                  column(
                                      'وكيل الكلية لشئون خدمة المجتمع وتنمية'),
                                  column('نائب رئيس مجلس الإدارة'),
                                ]),
                            TableRow(
                                decoration: BoxDecoration(
                                  color: Colors.grey.shade200,
                                ),
                                children: [
                                  column('م. رحاب محمود'),
                                  column('معيد بقسم نظم المعلومات'),
                                  column('عضوا'),
                                ]),
                            TableRow(
                                decoration: BoxDecoration(
                                  color: Colors.grey.shade200,
                                ),
                                children: [
                                  column('أ. علاء الدين هاشم'),
                                  column('مسئول الأمن بالكلية'),
                                  column('عضوا'),
                                ]),
                            TableRow(
                                decoration: BoxDecoration(
                                  color: Colors.grey.shade200,
                                ),
                                children: [
                                  column('أ.منال جابر طه'),
                                  column(
                                      'مكتب وكيل الكلية لشئون خدمة المجتمع وتنمية البيئة'),
                                  column('عضوا'),
                                ]),
                            TableRow(
                                decoration: BoxDecoration(
                                  color: Colors.grey.shade200,
                                ),
                                children: [
                                  column('أ/ أحمد صلاح'),
                                  column('سكرتارية'),
                                  column('عضوا'),
                                ]),
                          ],
                        )
                      ],
                    ),
                  ),
                ),
                MainCard(
                  'الرؤية',
                  Padding(
                    padding: const EdgeInsets.all(8.0),
                    child: Column(
                      children: [
                        row2('الرؤية :',
                            'تهدف وحدة ادارة الازمات الكوارث بكلية الحاسبات والمعلومات جامعة الفيوم إلى توفير بيئة عمل مستقرة وآمنة من خلال إعداد وتنفيذ خطط وبرامج للتامين والتعامل مع الازمات المتوقعة فى بيئة العمل.'),
                        row2('الرسالة :',
                            'تسعى وحدة ادارة الازمات الكوارث بكلية الحاسبات والمعلومات الى نشر الوعي بين العاملين وأعضاء هيئة التدريس والطلاب بثقافة ادرة الازمات والكوارث لتحقيق الامان والاستقرار فى بيئة العمل.'),
                        SizedBox(
                          height: 8,
                        ),
                      ],
                    ),
                  ),
                ),
                MainCard(
                  'الأنشطة',
                  Padding(
                    padding: const EdgeInsets.all(8.0),
                    child: Column(
                      children: [
                        centerTitle('مهام الوحدة'),
                        row('يمكن تقسيم مهام وحدة إدارة الأزمات والكوارث اعتمادا على وقت حدوث الأزمة كما يلي :'),
                        title2('أولا مرحلة ماقبل الأزمة:', Colors.red.shade900),
                        Description(
                            '• التخطيط الجيد لتلافى بعض الأزمات والتقليل من أثارها\n• تشكيل فرق إدارة أزمات\n• تدريب فريق ادارة الازمة والأفراد على السيناريوهات\n• تحديد الأزمات المتوقعة وأولويات التعامل معها\n• بناء نظام للاتصالات الفعالة عند حدوث الأزمة\n• تطوير السياسات اللازمة للحد من الأزمات\n• تطوير و توزيع دليل إرشادات الطوارئ\n• تجميع وتنظيم الموارد المتاحة\n• الاستفادة من تجارب وخبرات وحدات إدارة الزمات والكوارث فى الكليات الأخرى'),
                        title2('ثانيا مرحلة حدوث الأزمة:', Colors.red.shade900),
                        Description(
                            '• جعل الموقف تحت السيطرة كلما أمكن ذلك\n• اختيار متحدث رسمي واحد\n• المؤسسة هي المصدر الرئيسي للمعلومات لامداد العاملين بالمعلومات اللازمة اثناء الأزمة\n• تنفيذ الخطط والسيناريوهات التى سبق اعدادها'),
                        title2(
                            'ثالثا مرحلة ما بعد الأزمة:', Colors.red.shade900),
                        Description(
                            '• المتابعة\n• الإعلان عن انتهاء الأزمة\n• حصر الخسائر والتلفيات.\n• توثيق الأحداث\n• تقديم التوصيات والمقترحات اللازمة\n• تقييم الخطط والسيناريوهات التى تم تنفيذها اثناء التعامل مع الأزمة\n• إعادة الوضع الطبيعي لمؤسسات المجتمع.'),
                        centerTitle('واجبات فريق العمل'),
                        row(' واجبات فريق إدارة الأزمات :'),
                        Description(
                            'يتم تشكيل فريق إدارة الأزمات وتكليف أعضائه بعدة مهام وهي كالتالي :\n• إعداد الخطط وإدارة وتوجيه الفرق المشاركة فى أعمال الطوارئ\n• إرشاد المتدربين وشاغلي المبنى إلى طريق مسالك الهروب ومخارج الطوارئ ونقاط التجمع .\n• نقل الوثائق والأشياء ذات القيمة والأهمية .\n• تقديم الإسعافات الأولية ورفع الروح المعنوية لشاغلي المبنى\n• مساعدة مجموعات الفرق الأخرى مثل الإطفاء والإنقاذ والصحة والاستقبال وفصل التيار الكهربي .'),
                        SizedBox(
                          height: 16,
                        ),
                        row('واجبات فرق العمل من المتدربين والموظفين في حالات الطوارئ :'),
                        Description(
                            '• التحلي بالهدوء وعدم الارتباك .\n• إيقاف العمل فوراً.\n• قطع التيار الكهربائي عن المكان من قبل المسئول فقط .\n• عدم استخدام المصعد الكهربائي .\n• التوجه إلى نقطة التجمع من خلال مسالك الهروب ومخارج الطوارئ .\n• التنبيه على المتدربين بعدم الركض أو تجاوز زملائهم أو التدافع حتى لا تقع إصابات بينهم .'),
                        row_pdf('قواعد الأمان والسلامة', 'Brochures1', context),
                        row_pdf('قواعد استخدام طفايات الحريق', 'Brochures2',
                            context),
                        SizedBox(
                          height: 8,
                        ),
                      ],
                    ),
                  ),
                )
              ],
            ),
          ),
        ),
        context);
  }
}
